src/Catalogs/Scan_КоммерческиеПредложения/Scan_КоммерческиеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_КоммерческиеПредложения</name>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияКПSPORT</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКП</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКПSPORT</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродуктыКП</name>
    <attributes>
      <name>IDПродуктаКП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродуктаSPORT</name>
      <type>
        <types>CatalogRef.Scan_ТипыПродуктовКПSPORT</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Scan_СпецификацииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзделияПоПродуктам</name>
    <attributes>
      <name>IDПродуктаКП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_КоммерческиеПредложения/Forms/ФормаЗагрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если параметры.Свойство("МассивКП") и Параметры.МассивКП <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка", Параметры.МассивКП,ВидСравненияКомпоновкиДанных.ВСписке,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьПродукты(Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		ПродуктыКП.Очистить();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; //rarus vikhle 09.03.2021 mt 17386
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(ПоместитьТаблицуРезультатаВХранилище(ВладелецФормы.УникальныйИдентификатор, Элементы.Список.ТекущиеДанные.Ссылка, Элементы.ПродуктыКП.ТекущиеДанные.IDПродуктаКП));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПродукты(Ссылка)	
	ПродуктыКП.Загрузить(ссылка.продуктыкп.выгрузить());	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуРезультатаВХранилище(ИдентификаторВладельца,Ссылка,IDПродуктаКП)
	
	СтруктураПараметров = Новый Структура;

	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	СтруктураПараметров.Вставить("IDПродуктаКП", IDПродуктаКП);
	Возврат ПоместитьВоВременноеХранилище(СтруктураПараметров, ИдентификаторВладельца);
	
КонецФункции

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_КоммерческиеПредложения.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --

#КонецОбласти
